Revit 2024 API
BuiltInFailures.StairRampFailures.CannotCreateMonolithicStairs Property
 Can't make monolithic Stairs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateMonolithicStairs { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateMonolithicStairs As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateMonolithicStairs {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace